test_set = {
    "documents": [
        {
            "bs_rank_pos": 0,
            "paragraphs": [
                "少儿身份证编辑 锁定 ",
                "少儿身份证,即儿童身份证,是指16岁以下少年儿童按照自愿为原则,不受年龄限制,均可办理的一种身份证证件。",
                " 由于少年儿童还属于长身体阶段,容貌会随成长而变化,因此,与成年人不同的是少儿身份证有效期较短,仅为五年。"
                "另外,少年儿童必须有监护人陪同方可办理身份证。可以带来出行、安全保障等便利。",
                "中文名 少儿身份证  类别 身份证 ",
                " 人群 少儿 有效期 5年 ",
                " 1 便利之处 2 不同 ",
                "一、出行方便购买机票、遇到身份检查时,不再需要带户口本,出示身份证即可。二、办理身份证能获得一定的安全"
                "保障便利比如在遇到危险后,警方也能快速确定身份,通知家人。三、是出入境方便四、是在一些需要身份证明的行"
                "为中,得到方便。16周岁以下的孩子申请身份证手续与成人相同,证件本身的图案、颜色、大小也一样,唯一不同的"
                "是有效期为5年,而16周岁至25周岁的身份证有效期为10年,年龄再大的人身份证有效期更长。另外,少年儿童必须"
                "有监护人陪同方可办理身份证。",
                " 词条统计 浏览次数:次 编辑次数:16次历史版本 最近更新: 创建者:亲子互助"
            ],
            "segmented_title": ["少儿", "身份证", "_", "百度百科"],
            "segmented_paragraphs": [
                ["少儿", "身份证", "编辑", "锁定"],
                [
                    "少儿", "身份证", ",", "即",
                    "儿童", "身份证", ",", "是", "指",
                    "16", "岁", "以下", "少年儿童",
                    "按照", "自愿", "为", "原则", ",",
                    "不受", "年龄限制", ",", "均",
                    "可", "办理", "的", "一", "种",
                    "身份证", "证件", "。"
                ],
                [
                    "由于", "少年儿童", "还", "属于",
                    "长", "身体", "阶段", ",", "容貌",
                    "会", "随", "成长", "而", "变化",
                    ",", "因此", ",", "与", "成年人",
                    "不同", "的", "是", "少儿",
                    "身份证", "有效期", "较", "短",
                    ",", "仅", "为", "五年", "。",
                    "另外", ",", "少年儿童", "必须",
                    "有", "监护人", "陪同", "方", "可",
                    "办理", "身份证", "。", "可以",
                    "带来", "出行", "、", "安全保障",
                    "等", "便利", "。"
                ],
                [
                    "中文名", "少儿", "身份证", "类别",
                    "身份证"
                ],
                [
                    "人群", "少儿", "有效期", "5",
                    "年"
                ],
                [
                    "1", "便利", "之", "处", "2",
                    "不同"
                ],
                [
                    "一", "、", "出行", "方便", "购买",
                    "机票", "、", "遇到", "身份",
                    "检查", "时", ",", "不再", "需要",
                    "带", "户口本", ",", "出示",
                    "身份证", "即可", "。", "二", "、",
                    "办理", "身份证", "能", "获得",
                    "一定", "的", "安全", "保障",
                    "便利", "比如", "在", "遇到",
                    "危险", "后", ",", "警方", "也",
                    "能", "快速", "确定", "身份", ",",
                    "通知", "家人", "。", "三", "、",
                    "是", "出入境", "方便", "四", "、",
                    "是", "在", "一些", "需要",
                    "身份证明", "的", "行为", "中",
                    ",", "得到", "方便", "。", "16",
                    "周岁", "以下", "的", "孩子",
                    "申请", "身份证", "手续", "与",
                    "成人", "相同", ",", "证件",
                    "本身", "的", "图案", "、", "颜色",
                    "、", "大小", "也", "一样", ",",
                    "唯一", "不同", "的", "是",
                    "有效期", "为", "5", "年", ",",
                    "而", "16", "周岁", "至", "25",
                    "周岁", "的", "身份证", "有效期",
                    "为", "10", "年", ",", "年龄",
                    "再", "大", "的", "人", "身份证",
                    "有效期", "更", "长", "。", "另外",
                    ",", "少年儿童", "必须", "有",
                    "监护人", "陪同", "方", "可",
                    "办理", "身份证", "。"
                ],
                [
                    "词条", "统计", "浏览次数", ":",
                    "次", "编辑", "次数", ":", "16",
                    "次", "历史", "版本", "最近更新",
                    ":", "创建", "者", ":", "亲子",
                    "互助"
                ]
            ],
            "title": "少儿身份证_百度百科"
        },
        {
            "bs_rank_pos": 1,
            "paragraphs": [
                "孩子多大能办身份证?根据派出所的规定,只要孩子愿意办身份证,16岁以下也可以办理,但是需要在"
                "家长或监护人的陪同下办理,并且有效期只有5年,当然,这其中也包括新生儿可以办理身份证。",
                " 答:办理身份证不受年龄限制!",
                " 现在未成年人也可以办理身份证的,没有年龄限制。", " 16岁以下办理身份证,须在家长或监护人陪同,有效期为5年。",
                " 16岁以上的,本人办理,初次有效期10年,26岁以后有效期为20年,46岁以后终身有效。",
                " 新生儿能办身份证吗 答:能办! 儿身份证就是在未满十六周岁的少年儿童自愿的情况下,"
                "申请办理的身份证件,这类身份证必须由家长陪同才能办理,而且有效期只有五年。有了儿童身份证,"
                "在很多需要身份证明的场合,不需要再出示户口本,有身份证即可。 "
                "未成年人办理身份证,首先要遵循该未成年人自主自愿的原则,在父母的陪同下去办理。 "
                "过程: 1、未成年人如何办理身份证 儿童身份证办理流程 "
                "2、所需要的证件有:父母的身份证、孩子的户口簿、孩子的出生证明、学籍证明(未上学的可以不必带),以上证件均为原件。 "
                "未成年人如何办理身份证 儿童身份证办理流程 3、带齐上述证件之后,带着孩子到户籍所在派出所申请办理即可,"
                "一般需要缴纳20元的费用,等待一个月左右取证。领取身份证时,需要带着户口本和取证单据。 "
                "注意事项: 1、在申请身份证的时候,孩子要穿着深色有领子的上衣,和我们成人申请身份证的要求相同。"
                " 2、未成年人如何办理身份证 儿童身份证办理流程 3、拍摄身份证照片时,要求孩子能够单独坐正,"
                "不能有旁人的协助,所以,太小的孩子还不适宜申领身份证。 4、儿童身份证的有效期是5年,如果孩子在成长过程中,"
                "样貌发生了较大变化,家长需要及时带孩子去更换身份证上的照片,以免造成不必要的麻烦。",
                " 孩子办身份证流程 如果年满16岁,可以带户口本到户口所在地派出所申请。"
                "流程如下:  1.先去公安机关定点的照相馆拍证件照。要求免冠(不带帽子,如果由眼镜的话最好眼镜也不要带),"
                "穿衣服看自己,不过最好不要太花哨。20元/人  2.取得照片后,照片会附一张单子,上面有你的照片编号。这张单子很重要,"
                "一定不能弄丢。  3.带上照片和单子、户口册到户口所在地派出所申请办理。交6块钱,然后公安机关会告诉你什么时候去拿。"
                "到时候去拿就是了。通常一代换二代是三到四个月。第一次办理的话通常是当年年底拿  "
                "4.如果是老身份证换二带,去拿新证的时候要把老证带过去,如果是第一次办就带户口册去拿  "
                "5.如果是大学生或其他原因,户口是集体户口的,还需要相关证明",
                "儿童百科知识 新闻资讯 ",
                " 还可以输入140字 ",
                " 还没有人评论哦,赶紧抢一个沙发吧!"
            ],
            "segmented_title": [
                "【", "孩子", "多大", "能", "办", "身份证", "】", "_", "新生儿", "能",
                "办", "身份证", "吗", "_", "孩子", "多大", "能", "领", "身份证",
                "_"
            ],
            "segmented_paragraphs": [
                [
                    "孩子", "多大", "能", "办", "身份证", "?", "根据", "派出所", "的", "规定", ",", "只要", "孩子", "愿意", "办", "身份证", ",",
                    "16",
                    "岁",
                    "以下", "也", "可以", "办理", ",", "但是", "需要", "在", "家长", "或", "监护人", "的", "陪同", "下", "办理", ",", "并且",
                    "有效期",
                    "只有",
                    "5", "年", ",", "当然", ",", "这其中", "也", "包括", "新生儿", "可以", "办理", "身份证", "。"
                ],
                [
                    "答", ":", "办理", "身份证", "不受", "年龄限制", "!"
                ],
                [
                    "现在", "未成年人", "也", "可以", "办理", "身份证", "的", ",", "没有", "年龄限制", "。"
                ],
                [
                    "16", "岁", "以下", "办理", "身份证", ",", "须", "在", "家长", "或", "监护人", "陪同", ",", "有效期", "为", "5", "年", "。"
                ],
                [
                    "16", "岁", "以上", "的", ",", "本人", "办理", ",", "初次", "有效期", "10", "年", ",", "26岁", "以后", "有效期", "为",
                    "20",
                    "年",
                    ",", "46", "岁", "以后", "终身", "有效", "。"
                ],
                [
                    "新生儿", "能", "办", "身份证", "吗", "答", ":", "能", "办", "!", "儿", "身份证", "就是", "在", "未", "满", "十六", "周岁",
                    "的",
                    "少年",
                    "儿童", "自愿", "的", "情况", "下", ",", "申请", "办理", "的", "身份证件", ",", "这", "类", "身份证", "必须", "由", "家长",
                    "陪同",
                    "才能",
                    "办理", ",", "而且", "有效期", "只有", "五年", "。", "有", "了", "儿童", "身份证", ",", "在", "很多", "需要", "身份证明", "的",
                    "场合",
                    ",",
                    "不需要", "再", "出示", "户口本", ",", "有", "身份证", "即可", "。", "未成年人", "办理", "身份证", ",", "首先", "要", "遵循", "该",
                    "未成年人",
                    "自主", "自愿", "的", "原则", ",", "在", "父母", "的", "陪同", "下去", "办理", "。", "过程", ":", "1", "、", "未成年人",
                    "如何",
                    "办理",
                    "身份证", "儿童", "身份证", "办理流程", "2", "、", "所", "需要", "的", "证件", "有", ":", "父母", "的", "身份证", "、", "孩子",
                    "的",
                    "户口簿",
                    "、", "孩子", "的", "出生", "证明", "、", "学籍", "证明", "(", "未", "上学", "的", "可以", "不必", "带", ")", ",", "以上",
                    "证件",
                    "均为",
                    "原件", "。", "未成年人", "如何", "办理", "身份证", "儿童", "身份证", "办理流程", "3", "、", "带", "齐", "上述", "证件", "之后",
                    ",",
                    "带",
                    "着",
                    "孩子", "到", "户籍", "所在", "派出所", "申请", "办理", "即可", ",", "一般", "需要", "缴纳", "20", "元", "的", "费用", ",",
                    "等待",
                    "一个月",
                    "左右", "取证", "。", "领取", "身份证", "时", ",", "需要", "带", "着", "户口本", "和", "取证", "单据", "。", "注意事项", ":",
                    "1",
                    "、",
                    "在", "申请", "身份证", "的", "时候", ",", "孩子", "要", "穿着", "深色", "有", "领子", "的", "上衣", ",", "和", "我们", "成人",
                    "申请",
                    "身份证", "的", "要求", "相同", "。", "2", "、", "未成年人", "如何", "办理", "身份证", "儿童", "身份证", "办理流程", "3", "、",
                    "拍摄",
                    "身份证",
                    "照片", "时", ",", "要求", "孩子", "能够", "单独", "坐", "正", ",", "不能", "有", "旁", "人", "的", "协助", ",", "所以",
                    ",",
                    "太",
                    "小", "的", "孩子", "还", "不适宜", "申领", "身份证", "。", "4", "、", "儿童", "身份证", "的", "有效期", "是", "5", "年", ",",
                    "如果",
                    "孩子", "在", "成长", "过程", "中", ",", "样貌", "发生", "了", "较", "大", "变化", ",", "家长", "需要", "及时", "带", "孩子",
                    "去",
                    "更换",
                    "身份证", "上", "的", "照片", ",", "以", "免", "造成", "不必要", "的", "麻烦", "。"
                ],
                [
                    "孩子", "办", "身份证", "流程", "如果", "年", "满", "16", "岁", ",", "可以", "带", "户口本", "到", "户口所在地", "派出所", "申请",
                    "。",
                    "流程",
                    "如", "下", ":", "1", ".", "先", "去", "公安机关", "定点", "的", "照相馆", "拍", "证件照", "。", "要求", "免冠", "(", "不",
                    "带",
                    "帽子",
                    ",", "如果", "由", "眼镜", "的", "话", "最好", "眼镜", "也", "不要", "带", ")", ",", "穿衣服", "看", "自己", ",", "不过",
                    "最好不要",
                    "太",
                    "花哨", "。", "20", "元", "/", "人", "2", ".", "取得", "照片", "后", ",", "照片", "会", "附一", "张", "单子", ",",
                    "上面",
                    "有",
                    "你", "的", "照片", "编号", "。", "这", "张", "单子", "很重要", ",", "一定", "不能", "弄", "丢", "。", "3", ".", "带",
                    "上",
                    "照片",
                    "和", "单子", "、", "户口", "册", "到", "户口所在地", "派出所", "申请", "办理", "。", "交", "6", "块", "钱", ",", "然后",
                    "公安机关",
                    "会",
                    "告诉", "你", "什么时候", "去", "拿", "。", "到时候", "去", "拿", "就是", "了", "。", "通常", "一", "代换", "二代", "是", "三",
                    "到",
                    "四个月",
                    "。", "第一次", "办理", "的", "话", "通常", "是", "当年", "年底", "拿", "4", ".", "如果", "是", "老", "身份证", "换", "二",
                    "带",
                    ",",
                    "去", "拿", "新", "证", "的", "时候", "要", "把", "老", "证", "带", "过去", ",", "如果", "是", "第一次", "办", "就", "带",
                    "户口",
                    "册",
                    "去", "拿", "5", ".", "如果", "是", "大学生", "或", "其他", "原因", ",", "户口", "是", "集体户口", "的", ",", "还", "需要",
                    "相关",
                    "证明"
                ],
                ["儿童", "百科知识", "新闻资讯"],
                ["还", "可以", "输入", "140", "字"],
                ["还", "没有人", "评论", "哦", ",", "赶紧", "抢", "一", "个", "沙发", "吧", "!"]
            ],
            "title": "【孩子多大能办身份证】_新生儿能办身份证吗_孩子多大能领身份证_"
        },
        {
            "bs_rank_pos": 2,
            "paragraphs": [
                " 1.办理入户手续后,系统内即产生相应的身份证号码。故可办理身份证 2.因小孩年龄太小,不方便照相,建议等年纪大点再去办理. "
                "公安部对居民身份证办理年龄规定第二条 居住在中华人民共和国境内的年满十六周岁的中国公民,"
                "应当依照本法的规定申请领取居民身份证;未满十六周岁的中国公民,可以依照本法的规定申请领取居民身份证。"
                "第五条 十六周岁以上公民的居民身份证的有效期为十年、二十年、长期。"
                "十六周岁至二十五周岁的,发给有效期十年的居民身份证;二十六周岁至四十五周岁的,"
                "发给有效期二十年的居民身份证;四十六周岁以上的,发给长期有效的居民身份证。"
                "未满十六周岁的公民,自愿申请领取居民身份证的,发给有效期五年的居民身份证。 ",
                " 旋转马戏团 2013-04-05 16:52 ",
                " 宝宝知道提示您:回答为网友贡献,仅供参考。",
                " 中国公民年满16周岁,可以到户籍所在地公安部门申领身份证!,这里有个条件是年满16周岁!",
                " hyr0829 2013-04-05 16:51 ",
                " 小孩子可以上户口,身份证那么小的孩子还没有的",
                " 嘎个猪头 2013-04-05 16:51 ",
                " 不能,太小了 扁予甘雨皿0428 2013-04-05 16:57 ",
                " 刚出生的儿童就可办证 5年后重新换证",
                " lumingz11111 2013-04-05 17:04 "
            ],
            "segmented_title": [
                "出生",
                "一个月",
                "的",
                "婴儿",
                "可以",
                "办",
                "身份证",
                "吗",
                "?",
                "_",
                "百度",
                "宝宝",
                "知道"
            ],
            "segmented_paragraphs": [
                [
                    "1", ".", "办理", "入户",
                    "手续", "后", ",", "系统",
                    "内", "即", "产生", "相应",
                    "的", "身份证号码", "。", "故",
                    "可", "办理", "身份证", "2",
                    ".", "因", "小孩", "年龄",
                    "太", "小", ",", "不",
                    "方便", "照相", ",", "建议",
                    "等", "年纪", "大", "点",
                    "再", "去", "办理", ".",
                    "公安部", "对", "居民",
                    "身份证", "办理", "年龄",
                    "规定", "第二条", "居住", "在",
                    "中华人民共和国", "境内", "的",
                    "年", "满", "十六", "周岁",
                    "的", "中国公民", ",", "应当",
                    "依照", "本", "法", "的",
                    "规定", "申请", "领取", "居民",
                    "身份证", ";", "未", "满",
                    "十六", "周岁", "的",
                    "中国公民", ",", "可以",
                    "依照", "本", "法", "的",
                    "规定", "申请", "领取", "居民",
                    "身份证", "。", "第五条",
                    "十六", "周岁", "以上", "公民",
                    "的", "居民", "身份证", "的",
                    "有效期", "为", "十", "年",
                    "、", "二", "十", "年",
                    "、", "长期", "。", "十六",
                    "周岁", "至", "二", "十",
                    "五", "周岁", "的", ",",
                    "发给", "有效期", "十", "年",
                    "的", "居民", "身份证", ";",
                    "二", "十", "六", "周岁",
                    "至", "四", "十", "五",
                    "周岁", "的", ",", "发给",
                    "有效期", "二", "十", "年",
                    "的", "居民", "身份证", ";",
                    "四", "十", "六", "周岁",
                    "以上", "的", ",", "发给",
                    "长期", "有效", "的", "居民",
                    "身份证", "。", "未", "满",
                    "十六", "周岁", "的", "公民",
                    ",", "自愿", "申请", "领取",
                    "居民", "身份证", "的", ",",
                    "发给", "有效期", "五年", "的",
                    "居民", "身份证", "。"
                ],
                [
                    "旋转", "马戏团", "2013",
                    "-", "04", "-", "05",
                    "16", ":", "52"
                ],
                [
                    "宝宝", "知道", "提示", "您",
                    ":", "回答", "为", "网友",
                    "贡献", ",", "仅供参考",
                    "。"
                ],
                [
                    "中国公民", "年", "满", "16",
                    "周岁", ",", "可以", "到",
                    "户籍所在地", "公安部门", "申领",
                    "身份证", "!", ",", "这里",
                    "有", "个", "条件", "是",
                    "年", "满", "16", "周岁",
                    "!"
                ],
                [
                    "hyr", "0829", "2013",
                    "-", "04", "-", "05",
                    "16", ":", "51"
                ],
                [
                    "小孩子", "可以", "上", "户口",
                    ",", "身份证", "那么", "小",
                    "的", "孩子", "还没有", "的"
                ],
                [
                    "嘎", "个", "猪头", "2013",
                    "-", "04", "-", "05",
                    "16", ":", "51"
                ],
                [
                    "不能", ",", "太", "小",
                    "了", "扁", "予", "甘雨皿",
                    "0428", "2013", "-",
                    "04", "-", "05", "16",
                    ":", "57"
                ],
                [
                    "刚", "出生", "的", "儿童",
                    "就", "可", "办", "证",
                    "5", "年", "后", "重新",
                    "换", "证"
                ],
                [
                    "lumingz", "11111",
                    "2013", "-", "04", "-",
                    "05", "17", ":",
                    "04"
                ]
            ],
            "title": "出生一个月的婴儿可以办身份证吗?_百度宝宝知道"
        },
        {
            "bs_rank_pos": 3,
            "paragraphs": [
                " 文章 总阅读 ",
                "黄女士家境比拟殷实,女儿如今1岁多,黄女士想着在女儿小的时分就给她存一笔存款,"
                "当前万一有什麼变故女儿也不至于跟着享福。于是黄女士就以女儿的名义去银行开户,但是银行方面说想要开户得女儿的身份证,"
                "之后问了几家银行也都这麼说的。黄女士觉得这有点爲难问,女儿才1岁,怎样操持身份证呢?其实好多人都有黄女士这样的困惑,"
                "那麼孩子究竟什麼时分可以操持身份证呢?",
                " 在大少数人的观念里觉得,孩子只要满16周岁才可以操持身份证。但是如今政策改了,孩子出生后,"
                "只需上了户口,有了身份证号码就可以操持身份证了。不过由于孩子发育快,"
                "变化比拟大,所以16周岁以下的孩子操持的身份证无效期是5年。也就是假如孩子是3岁操持的身份证,"
                "那麼8岁的时分就要去换新的,次要是身份证上的照片需求改换。",
                " 给孩子操持身份证的流程是什麼呢?",
                " 孩子操持身份证的时分需求父母的陪同,而且要穿深色的衣服。"
                "另外还要带上父母的身份证、孩子的户口本、孩子的出生证明、学籍证明(没有的话可以不带),而且都得是原件。",
                " 需求留意的是,拍摄照片的时分是需求孩子可以单独坐正的,所以太小的孩子不合适操持身份证。",
                " 孩子操持身份证的益处有哪些呢?",
                " 可以获取一定的平安保证,特别是在遇到风险的时分,警方可以疾速确实认孩子身份,与父母联络。"
                "还可以留作留念,毕竟小孩子的光阴过来就不复返了。另外,出出境方便,操持业务也比拟方便。返回搜狐,查看更多",
                "声明:本文由入驻搜狐号的作者撰写,除搜狐官方账号外,观点仅代表作者本人,不代表搜狐立场。"
            ],
            "segmented_title": [
                "小宝宝", "可以", "办", "身份证", "了", ",", "你不知道", "吧", "?", "好处", "还", "很多", "。", "_",
                "搜狐", "母婴", "_", "搜狐网"
            ],
            "segmented_paragraphs": [
                ["文章", "总", "阅读"],
                [
                    "黄", "女士", "家境", "比拟", "殷实",
                    ",", "女儿", "如今", "1", "岁",
                    "多", ",", "黄", "女士", "想着",
                    "在", "女儿", "小", "的", "时",
                    "分", "就", "给", "她", "存", "一",
                    "笔", "存款", ",", "当前", "万一",
                    "有", "什", "麼", "变故", "女儿",
                    "也", "不", "至于", "跟着", "享福",
                    "。", "于是", "黄", "女士", "就",
                    "以", "女儿", "的", "名义", "去",
                    "银行开户", ",", "但是", "银行",
                    "方面", "说", "想要", "开户", "得",
                    "女儿", "的", "身份证", ",", "之后",
                    "问", "了", "几", "家", "银行",
                    "也", "都", "这", "麼", "说", "的",
                    "。", "黄", "女士", "觉得", "这",
                    "有点", "爲难", "问", ",", "女儿",
                    "才", "1", "岁", ",", "怎样",
                    "操持", "身份证", "呢", "?", "其实",
                    "好多人", "都", "有", "黄", "女士",
                    "这样", "的", "困惑", ",", "那",
                    "麼", "孩子", "究竟", "什", "麼",
                    "时", "分", "可以", "操持", "身份证",
                    "呢", "?"
                ],
                [
                    "在", "大", "少数", "人", "的",
                    "观念", "里", "觉得", ",", "孩子",
                    "只要", "满", "16", "周岁", "才",
                    "可以", "操持", "身份证", "。", "但是",
                    "如今", "政策", "改", "了", ",",
                    "孩子", "出生", "后", ",", "只",
                    "需", "上", "了", "户口", ",",
                    "有", "了", "身份证号码", "就", "可以",
                    "操持", "身份证", "了", "。", "不过",
                    "由于", "孩子", "发育", "快", ",",
                    "变化", "比拟", "大", ",", "所以",
                    "16", "周岁", "以下", "的", "孩子",
                    "操持", "的", "身份证", "无效", "期",
                    "是", "5", "年", "。", "也",
                    "就是", "假如", "孩子", "是", "3",
                    "岁", "操持", "的", "身份证", ",",
                    "那", "麼", "8", "岁", "的", "时",
                    "分", "就要", "去", "换", "新",
                    "的", ",", "次", "要", "是",
                    "身份证", "上", "的", "照片", "需求",
                    "改换", "。"
                ],
                [
                    "给", "孩子", "操持", "身份证", "的",
                    "流程", "是", "什", "麼", "呢",
                    "?"
                ],
                [
                    "孩子", "操持", "身份证", "的", "时",
                    "分", "需求", "父母", "的", "陪同",
                    ",", "而且", "要", "穿", "深色",
                    "的", "衣服", "。", "另外", "还要",
                    "带", "上", "父母", "的", "身份证",
                    "、", "孩子", "的", "户口本", "、",
                    "孩子", "的", "出生", "证明", "、",
                    "学籍", "证明", "(", "没有", "的",
                    "话", "可以", "不", "带", ")",
                    ",", "而且", "都", "得", "是",
                    "原件", "。"
                ],
                [
                    "需求", "留意", "的", "是", ",",
                    "拍摄", "照片", "的", "时", "分",
                    "是", "需求", "孩子", "可以", "单独",
                    "坐", "正", "的", ",", "所以",
                    "太", "小", "的", "孩子", "不合适",
                    "操持", "身份证", "。"
                ],
                [
                    "孩子", "操持", "身份证", "的", "益处",
                    "有", "哪些", "呢", "?"
                ],
                [
                    "可以", "获取", "一定", "的", "平安",
                    "保证", ",", "特别", "是", "在",
                    "遇到", "风险", "的", "时", "分",
                    ",", "警方", "可以", "疾速", "确实",
                    "认", "孩子", "身份", ",", "与",
                    "父母", "联络", "。", "还", "可以",
                    "留", "作", "留念", ",", "毕竟",
                    "小孩子", "的", "光阴", "过来", "就",
                    "不", "复", "返", "了", "。",
                    "另外", ",", "出", "出境", "方便",
                    ",", "操持", "业务", "也", "比拟",
                    "方便", "。", "返回", "搜狐", ",",
                    "查看", "更多"
                ],
                [
                    "声明", ":", "本", "文", "由",
                    "入驻", "搜狐", "号", "的", "作者",
                    "撰写", ",", "除", "搜狐", "官方",
                    "账号", "外", ",", "观点", "仅",
                    "代表", "作者", "本人", ",", "不",
                    "代表", "搜狐", "立场", "。"
                ]
            ],
            "title": "小宝宝可以办身份证了,你不知道吧?好处还很多。_搜狐母婴_搜狐网"
        },
        {
            "bs_rank_pos": 4,
            "paragraphs": [
                "小宝宝也可以有自己的身份证。李浩摄",
                "“宝宝坐正啦!孩子妈妈麻烦你帮忙扶一下……”10月24日,在沈河区身份证办理大厅,"
                "记者见证宝宝办理身份证时的“热闹”的场面小小的影像采集室里,民警、家长围着宝宝忙成一团。",
                "自2005年开始,二代身份证换发取消了年龄限制,为宝宝办理身份证也经历了从无到有的过程,"
                "16岁以下少年儿童办理身份证的数目更是快速增长。乘坐飞机、携子出国、成长留念……出于各种原因为宝宝办理身份证的家长越来越多。",
                "在未满16周岁办理身份证的居民中,除了大部分是参加考试需要用身份证的学生外,还有一部分是婴幼儿。"
                "“有些孩子才刚刚会走路,家长就给孩子办理了身份证,多是出于方便出行的考虑,孩子有了身份证,就不用带上户口簿到处走了。”",
                "一个月前,市民张女士带着自己仅百天的宝宝来到和平区户政大厅想要为孩子办理身份证。"
                "“年底我要带孩子去美国的父亲那里,如果不给宝宝办理身份证,到时候办理相关手续可能还得拿着出生证明和户口簿,"
                "太麻烦了,办完了就省事儿了。”抱着宝宝的张女士对工作人员解释了自己为孩子办证的初衷。"
                "就这个百天宝宝,民警们忙了整整一个上午才拍完照、办完手续。",
                "还有的家长给宝宝办身份证,是为了留个纪念。“我家宝宝小名叫兵兵,"
                "今年刚过一岁,来这儿办身份证就是想给孩子留个纪念,多好啊,让娃娃和大人一样,"
                "走哪儿都有身份证明了!”带着孙子到身份证办理处领宝宝身份证的孙大娘告诉记者。"
                "“小家伙的身份证有效期5年,如果你需要经常带着小家伙坐飞机出游的话,去办一张会很方便。而且,办身份证本身也有纪念意义。”",
                "不过,也有很多家长并不知道婴儿也可办身份证,梁小姐就是一个,她说:“婴儿也可以办身份证吗?改天也给我家宝贝办一张。”",
                "据了解,市内五区各身份证办理处每天约办理宝宝身份证2-3个。“平均下来,幼儿办理身份证拍照平均最少也需要半个小时,"
                "多则五、六个小时,3个宝宝可能就需要近10个小时的时间来完成拍照。"
                "”市公安沈河分局身份证办理大厅民警孙丽告诉记者:“如果有家长带着孩子来办理身份证,"
                "我们做的第一件事就是规劝孩子的家长放弃给宝宝办理身份证的想法,但劝成功的很少。"
                "如果是出于办理出国等必须用到宝宝身份证的考虑,我们还是会为宝宝办理身份证的。”",
                "“每次有幼儿来办理身份证,我们要单独腾出一个照相室,因为小孩子没办法很稳地坐在凳子上,"
                "而且经常会哭闹,民警必须辅助家长逗孩子笑、让孩子坐正,拍照结束后经常会搞得家长和民警都疲惫不堪。"
                "”孙丽说:“办理大厅每天都要接待上百市民办理身份证,我们一般都会优先照顾宝宝拍身份证,"
                "但这样做就意味着增加了其他市民的等待时间,往往会引起一些人的不满。”",
                "最近,很多市民听说一代身份证要“退役”,蜂拥而至办理二代身份证。警方希望给孩子办证的家长,过了这段办证高峰期再来给宝宝办证。 ",
                " + 加载更多新闻 ",
                " \"63%农村孩子没上高中\"数据滞后 从朝获释大学生验尸结果:未遭折磨 C919完成复飞:飞行2小时46分钟",
                " 底盘调校见功力 场地体验全新别克君威GS 日本公寓厨房傻瓜指南 细节多到把外国人搞疯了 艳星袁嘉敏搭阔少老外 狂吻到停不下来",
                "网易商城,您身边24小时的联通电信移动营业厅 随时随地为您提供手机话费充值服务。"
            ],
            "segmented_title": [
                "给", "宝宝", "办", "身份证", "能", "缓",
                "还是", "缓一缓", "(", "组图", ")", "_",
                "网易新闻"
            ],
            "segmented_paragraphs": [
                [
                    "小宝宝", "也", "可以", "有", "自己", "的", "身份证", "。",
                    "李浩", "摄"
                ],
                [
                    "“", "宝宝", "坐", "正", "啦", "!", "孩子", "妈妈", "麻烦",
                    "你", "帮忙", "扶", "一", "下", "…", "…", "”", "10",
                    "月", "24", "日", ",", "在", "沈河区", "身份证", "办理",
                    "大厅", ",", "记者", "见证", "宝宝", "办理", "身份证", "时",
                    "的", "“", "热闹", "”", "的", "场面", "小小", "的", "影像",
                    "采集", "室", "里", ",", "民警", "、", "家长", "围着",
                    "宝宝", "忙", "成", "一", "团", "。"
                ],
                [
                    "自", "2005", "年", "开始", ",", "二代", "身份证", "换",
                    "发", "取消", "了", "年龄限制", ",", "为", "宝宝", "办理",
                    "身份证", "也", "经历", "了", "从无到有", "的", "过程", ",",
                    "16", "岁", "以下", "少年", "儿童", "办理", "身份证", "的",
                    "数目", "更", "是", "快速增长", "。", "乘坐飞机", "、", "携",
                    "子", "出国", "、", "成长", "留念", "…", "…", "出于",
                    "各种", "原因", "为", "宝宝", "办理", "身份证", "的", "家长",
                    "越来越多", "。"
                ],
                [
                    "在", "未", "满", "16", "周岁", "办理", "身份证", "的",
                    "居民", "中", ",", "除了", "大部分", "是", "参加", "考试",
                    "需要", "用", "身份证", "的", "学生", "外", ",", "还有",
                    "一部分", "是", "婴幼儿", "。", "“", "有些", "孩子", "才",
                    "刚刚", "会", "走路", ",", "家长", "就", "给", "孩子",
                    "办理", "了", "身份证", ",", "多", "是", "出于", "方便",
                    "出行", "的", "考虑", ",", "孩子", "有", "了", "身份证",
                    ",", "就", "不用", "带", "上", "户口", "簿", "到处", "走",
                    "了", "。", "”"
                ],
                [
                    "一个月", "前", ",", "市民", "张", "女士", "带", "着",
                    "自己", "仅", "百", "天", "的", "宝宝", "来到", "和平区",
                    "户", "政", "大厅", "想要", "为", "孩子", "办理", "身份证",
                    "。", "“", "年底", "我", "要", "带", "孩子", "去", "美国",
                    "的", "父亲", "那里", ",", "如果", "不", "给", "宝宝",
                    "办理", "身份证", ",", "到时候", "办理", "相关", "手续", "可能",
                    "还", "得", "拿着", "出生", "证明", "和", "户口簿", ",",
                    "太麻烦", "了", ",", "办完", "了", "就", "省", "事儿", "了",
                    "。", "”", "抱着", "宝宝", "的", "张", "女士", "对", "工作",
                    "人员", "解释", "了", "自己", "为", "孩子", "办", "证", "的",
                    "初衷", "。", "就", "这个", "百", "天", "宝宝", ",", "民警",
                    "们", "忙", "了", "整", "整", "一", "个", "上午", "才",
                    "拍", "完", "照", "、", "办完", "手续", "。"
                ],
                [
                    "还有", "的", "家长", "给", "宝宝", "办", "身份证", ",",
                    "是", "为了", "留", "个", "纪念", "。", "“", "我", "家",
                    "宝宝", "小名", "叫", "兵", "兵", ",", "今年", "刚", "过",
                    "一", "岁", ",", "来这儿", "办", "身份证", "就是", "想",
                    "给", "孩子", "留", "个", "纪念", ",", "多", "好", "啊",
                    ",", "让", "娃娃", "和", "大人", "一样", ",", "走", "哪儿",
                    "都", "有", "身份证明", "了", "!", "”", "带", "着", "孙子",
                    "到", "身份证", "办理", "处", "领", "宝宝", "身份证", "的",
                    "孙", "大娘", "告诉记者", "。", "“", "小家伙", "的", "身份证",
                    "有效期", "5", "年", ",", "如果", "你", "需要", "经常",
                    "带", "着", "小家伙", "坐飞机", "出游", "的", "话", ",",
                    "去", "办", "一", "张", "会", "很方便", "。", "而且", ",",
                    "办", "身份证", "本身", "也有", "纪念", "意义", "。", "”"
                ],
                [
                    "不过", ",", "也有", "很多", "家长", "并", "不知道", "婴儿",
                    "也", "可", "办", "身份证", ",", "梁", "小姐", "就是", "一",
                    "个", ",", "她说", ":", "“", "婴儿", "也", "可以", "办",
                    "身份证", "吗", "?", "改", "天", "也", "给", "我", "家",
                    "宝贝", "办", "一", "张", "。", "”"
                ],
                [
                    "据了解", ",", "市", "内", "五区", "各", "身份证", "办理",
                    "处", "每天", "约", "办理", "宝宝", "身份证", "2", "-",
                    "3", "个", "。", "“", "平均", "下来", ",", "幼儿", "办理",
                    "身份证", "拍照", "平均", "最少", "也", "需要", "半个小时", ",",
                    "多", "则", "五", "、", "六", "个", "小时", ",", "3",
                    "个", "宝宝", "可能", "就", "需要", "近", "10", "个",
                    "小时", "的", "时间", "来", "完成", "拍照", "。", "”", "市",
                    "公安", "沈河", "分局", "身份证", "办理", "大厅", "民警", "孙丽",
                    "告诉记者", ":", "“", "如果", "有", "家长", "带", "着",
                    "孩子", "来", "办理", "身份证", ",", "我们", "做", "的",
                    "第一件事", "就是", "规劝", "孩子", "的", "家长", "放弃", "给",
                    "宝宝", "办理", "身份证", "的", "想法", ",", "但", "劝",
                    "成功", "的", "很少", "。", "如果", "是", "出于", "办理出国",
                    "等", "必须", "用", "到", "宝宝", "身份证", "的", "考虑",
                    ",", "我们", "还是", "会", "为", "宝宝", "办理", "身份证",
                    "的", "。", "”"
                ],
                [
                    "“", "每次", "有", "幼儿", "来", "办理", "身份证", ",",
                    "我们", "要", "单独", "腾", "出", "一", "个", "照相", "室",
                    ",", "因为", "小孩子", "没办法", "很", "稳", "地", "坐",
                    "在", "凳子", "上", ",", "而且", "经常", "会", "哭闹", ",",
                    "民警", "必须", "辅助", "家长", "逗", "孩子", "笑", "、",
                    "让", "孩子", "坐", "正", ",", "拍照", "结束", "后", "经常",
                    "会", "搞", "得", "家长", "和", "民警", "都", "疲惫不堪",
                    "。", "”", "孙丽", "说", ":", "“", "办理", "大厅", "每天",
                    "都", "要", "接待", "上", "百", "市民", "办理", "身份证",
                    ",", "我们", "一般", "都会", "优先", "照顾", "宝宝", "拍",
                    "身份证", ",", "但", "这样做", "就", "意味着", "增加", "了",
                    "其他", "市民", "的", "等待", "时间", ",", "往往", "会引起",
                    "一些人", "的", "不满", "。", "”"
                ],
                [
                    "最近", ",", "很多", "市民", "听说", "一", "代", "身份证",
                    "要", "“", "退役", "”", ",", "蜂拥而至", "办理", "二代",
                    "身份证", "。", "警方", "希望", "给", "孩子", "办", "证",
                    "的", "家长", ",", "过", "了", "这", "段", "办", "证",
                    "高峰期", "再来", "给", "宝宝", "办", "证", "。"
                ],
                ["+", "加载", "更多", "新闻"],
                [
                    "\"", "63", "%", "农村", "孩子", "没", "上", "高中",
                    "\"", "数据", "滞后", "从", "朝", "获释", "大学生", "验尸",
                    "结果", ":", "未", "遭", "折磨", "C919", "完成", "复",
                    "飞", ":", "飞行", "2", "小时", "46", "分钟"
                ],
                [
                    "底盘", "调", "校", "见", "功力", "场地", "体验", "全新",
                    "别克", "君威", "GS", "日本", "公寓", "厨房", "傻瓜", "指南",
                    "细节", "多", "到", "把", "外国人", "搞", "疯了", "艳星",
                    "袁嘉敏", "搭", "阔少", "老外", "狂吻", "到", "停不下来"
                ],
                [
                    "网易", "商城", ",", "您", "身边", "24", "小时", "的",
                    "联通", "电信", "移动", "营业厅", "随时随地", "为您", "提供",
                    "手机", "话费", "充值", "服务", "。"
                ]
            ],
            "title": "给宝宝办身份证 能缓还是缓一缓(组图)_网易新闻"
        }
    ],
    "question": "婴儿 身份证",
    "segmented_question": ["婴儿", "身份证"],
    "question_type": "DESCRIPTION",
    "fact_or_opinion": "OPINION",
    "question_id": 221595
}

train_set = {
    "documents": [
        {
            "is_selected": True,
            "title": "iOS里,把一个页面链接分享给好友,好友在微信里打开这个链接,怎么跳",
            "most_related_para": 0,
            "segmented_title": [
                "iOS", "里", ",", "把", "一", "个", "页面", "链接", "分享", "给", "好友", ",", "好友", "在",
                "微信", "里", "打开", "这个", "链接", ",", "怎么", "跳"
            ],
            "segmented_paragraphs": [
                ["iOS", "里", ",", "把", "一", "个", "页面", "链接", "分享", "给", "微信", "好友", "(", "会话", ")", ",", "好友", "在",
                 "微信",
                 "里", "打开", "这个", "链接", ",", "也", "就是", "打开", "了", "一", "个", "网页", ",", "点击", "网页", "里", "的", "某", "个",
                 "地方", "后", "(", "比如", "网页", "中", "“", "打开", "xx", "应用程序", "”", "的", "按钮", ")", ",", "代码", "里", "怎么",
                 "设置",
                 "可以", "跳", "回到", "第三方", "app", "?", "知乎", "的", "ios", "客户端", "就", "有", "这种", "功能", ",", "在", "微信", "里",
                 "分享", "链接", "后", ",", "点", "开", "链接", ",", "再", "点", "网页", "中", "的", "某处", ",", "就", "可以", "打开", "知乎",
                 "客户端", "显示全部"],
                ["微信", "中", "不能", "用", "自定义", "url", "的", "方式", ",", "微信", "提供", "了", "打开", "第三方", "应用", "的", "接口", ":",
                 "launch", "3rd", "App"],
                ["谢", "。", "一般", "用", "自带", "浏览器", "可以", "调用", "起", "app", "没问题", "。", "微信", "里面", "能", "调出", "app",
                 "的",
                 ",", "是", "和", "腾讯", "有", "合作", "的", "应用", ",", "其他", "会", "被", "过滤", "掉", "。"],
                ["有", "一", "个", "公司", "的", "产品", ",", "叫", "魔", "窗", ",", "免费", "可以", "接入", "的"],
                ["分享", "出去", "的", "是", "一", "个", "网页", ",", "前端", "人员", "与", "app", "客户端", "人员", "约定", "好", "一", "个",
                 "头部",
                 "协议", "。", "当", "用户", "在", "网页", "的", "点击", "某", "个", "按钮", ",", "调用", "注册", "的", "协议", "头", ",", "就",
                 "可以", "呼", "起", "安装", "的", "app", "。", "比如", "知乎", "app", "可能", "注册", "了", "zhifu", ":", "/", "/",
                 "xxx",
                 "zhifu", ":", "/", "/", "就是", "约定", "好", "的", "xxx", "是", "指", "参数", "可以", "任意", "带", "这样", "访问", "后",
                 "就",
                 "可以", "呼", "起", "app", "了", "。"],
                ["目前", "已经", "解决", "直接", "从", "微信", "打开", "的", "链接", "可以直接", "点击", "下载", "APP", "的", "跳转", ",", "无需",
                 "再",
                 "通过", "另外", "浏览", "中", "打开", "才能", "点击", "下载", ",", "在", "微信", "中", "即可", "直接", "点击", "下载", ",", "需要",
                 "的",
                 "联系", "QQ", "77408026"],
                ["你可以", "去", "看看", "openinstall", ",", "它", "可以", "实现", "让", "用户", "分享", "链接", "让", "别", "的", "用户",
                 "可以打开",
                 "下载", "或者", "跳转", "APP", "。", "而且", "打开", "或者", "下载", "后", "还能", "获取", "到", "自己", "想", "传", "过去", "的",
                 "参数", "。"],
                ["方法", "一", ":", "微信", "API", "-", "-", "WXApp", "Extend", "Object", ".", "(", "参考", "app", "-", "微博",
                 ")",
                 "方法", "二", ":", "iOS", "9", "Universal", "Link", ".", "(", "参考", "app", "-", "蘑菇街", ")"],
                ["目前", "要", "先", "用", "浏览器", "打开", ",", "然后", "才能", "跳", "。", "有", "解决办法", "么"],
                ["下载", "知乎", "客户端", "与", "世界", "分享", "知识", "、", "经验", "和", "见解"], ["相关", "Live", "推荐"]
            ],
            "paragraphs": [
                "iOS里,把一个页面链接分享给微信好友(会话),好友在微信里打开这个链接,也就是打开了一个网页,"
                "点击网页里的某个地方后(比如网页中“打开xx应用程序”的按钮),代码里怎么设置可以跳回到第三方app?知乎的ios客户端就有这种功能,"
                "在微信里分享链接后,点开链接,再点网页中的某处,就可以打开知乎客户端显示全部",
                "微信中不能用自定义url的方式,微信提供了打开第三方应用的接口:launch3rdApp",
                "谢。一般用自带浏览器可以调用起app没问题。微信里面能调出app的,是和腾讯有合作的应用,其他会被过滤掉。",
                "有一个公司的产品,叫 魔窗,免费可以接入的",
                "分享出去的是一个网页,前端人员与app客户端人员约定好一个头部协议。 "
                "当用户在网页的点击某个按钮,调用注册的协议头,就可以呼起安装的app。比如知乎app可能注册了 "
                "zhifu://xxx zhifu:// 就是约定好的xxx 是指参数 可以任意带这样访问后就可以呼起app了。",
                "目前已经解决直接从微信打开的链接可以直接点击下载APP的跳转,无需再通过另外浏览中打开才能点击下载,在微信中即可直接点击下载,"
                "需要的联系QQ77408026",
                "你可以去看看openinstall,它可以实现让用户分享链接让别的用户可以打开下载或者跳转APP。"
                "而且打开或者下载后还能获取到自己想传过去的参数。",
                "方法一:微信API--WXAppExtendObject.(参考app-微博)方法二:iOS 9 Universal Link.(参考app-蘑菇街)",
                "目前要先用浏览器打开,然后才能跳。有解决办法么",
                "下载知乎客户端 与世界分享知识、经验和见解", "相关Live 推荐"
            ],
            "bs_rank_pos": 0
        },
        {
            "is_selected": True,
            "title": "怎么可以在微信里面打开APP下载链接地址_百度经验",
            "most_related_para": 4,
            "segmented_title": ["怎么", "可以", "在", "微信", "里面", "打开", "APP", "下载", "链接地址", "_", "百度", "经验"],
            "segmented_paragraphs": [
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["我们", "都", "知道", "手游", "、", "APP", "想", "在", "微信", "分享", "时", ",", "下载",
                 "的", "链接", "会", "被", "微信", "屏蔽", ",", "不能", "直接", "点击", ",", "那", "怎样",
                 "才能", "得到", "微信", "认可", "的", "下载", "页面", "呢", ",", "这里", "就", "需要", "用",
                 "到", "腾讯", "的", "开放", "平台", ",", "而", "你", "的", "应用", "也", "需要提交", "到",
                 "这个平台", "。", "在", "这里", "可以", "得到", "微信", "认可", "的", "链接地址", "。", "接下来",
                 "介绍", "相关", "方法", "。"],
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["1", "首先", "打开", "腾讯", "开放", "平台", ",", "注册", "开放", "平台", "的", "一", "个",
                 "账号", ",", "如", "下", "图", "所示", "。", "步骤", "阅读", "2", "登录", "后", "在", "”",
                 "管理", "中心", "“", "中", "创建", "应用", ",", "如", "下", "图", "所示", "点击", "红线",
                 "框", "选", "按钮", "。", "步骤", "阅读", "3", "选择", "创建", "应用", "的", "类型", "如",
                 "下", "图", "所示", ",", "然后", "按钮", "提示", "填写", "应用", "的", "相关", "信息", ",",
                 "提交", "进入", "审核", "。", "步骤", "阅读", "步骤", "阅读", "4", "应用", "审核", "通过", "后",
                 "会", "在", "管理", "中心", "中", "显示", "”", "已", "上线", "“", ",", "然后", "点击",
                 "应用", "的", "图标", "。", "步骤", "阅读", "5", "在", "应用", "详情", "中", "找到", "运营",
                 "服务", "中", "的", "”", "微", "下载", "“", ",", "点击进入", "详情", "页面", "。", "步骤",
                 "阅读", "6", "在", "详情", "页面", "中", "就", "可以", "看到", "系统", "生成", "的", "推广",
                 "链接地址", "了", ",", "复制", "此", "地址", "就", "可以", "微信", "中", "转发", "了", "。",
                 "步骤", "阅读", "END"],
                ["经验", "内容", "仅供参考", ",", "如果", "您", "需", "解决", "具体", "问题", "(", "尤其", "法律",
                 "、", "医学", "等", "领域", ")", ",", "建议", "您", "详细", "咨询", "相关", "领域", "专业人士",
                 "。"]
            ],
            "paragraphs": [
                "百度经验:jingyan.baidu.com",
                "我们都知道手游、APP想在微信分享时,下载的链接会被微信屏蔽,不能直接点击,那怎样才能得到微信认可的下载页面呢"
                ",这里就需要用到腾讯的开放平台,而你的应用也需要提交到这个平台。在这里可以得到微信认可的链接地址。接下来介绍相关方法。",
                "百度经验:jingyan.baidu.com", "百度经验:jingyan.baidu.com",
                "1 首先打开腾讯开放平台,注册开放平台的一个账号,如下图所示。 步骤阅读 2 登录后在”管理中心“中创建应用,"
                "如下图所示点击红线框选按钮。 步骤阅读 3 选择创建应用的类型如下图所示,然后按钮提示填写应用的相关信息,提交进入审核。 "
                "步骤阅读 步骤阅读 4 应用审核通过后会在管理中心中显示”已上线“,然后点击应用的图标。 步骤阅读 5 在应用"
                "详情中找到运营服务中的”微下载“,点击进入详情页面。 步骤阅读 6 在详情页面中就可以看到系统生成的推广链接地址"
                "了,复制此地址就可以微信中转发了。 步骤阅读 END",
                "经验内容仅供参考,如果您需解决具体问题(尤其法律、医学等领域),建议您详细咨询相关领域专业人士。"
            ],
            "bs_rank_pos": 1
        },
        {
            "is_selected": False,
            "title": "android微信分享的链接怎么启动app-CSDN论坛",
            "most_related_para": 0,
            "segmented_title": ["android", "微信", "分享", "的", "链接", "怎么", "启动", "app", "-", "CSDN", "论坛"],
            "segmented_paragraphs": [
                ["app", "中", "分享", "到", "微信", "已经", "成功", ",", "但是", "通过", "分享", "的", "连接", "无法", "启动", "app",
                 "。"], ["分享", "的", "链接", "就是", "普通", "的", "自定义", "url", ":", "myapp", ":", "/", "/", "www", ".",
                        "myapp", ".", "com", "."],
                ["博客", "专家", "带", "你", "学", "swift", "晒", "图谱", ",", "涨", "知识", ",", "得", "好", "礼", "Swift",
                 "问题", "与", "解答", "视频直播", "技术", "免费", "课"]
            ],
            "paragraphs": [
                "app中分享到微信已经成功,但是通过分享的连接无法启动app。", "分享的链接就是普通的自定义url:myapp://www.myapp.com.",
                "博客专家带你学swift 晒图谱,涨知识,得好礼 Swift 问题与解答 视频直播技术免费课"
            ],
            "bs_rank_pos": 2},
        {
            "is_selected": False,
            "title": "android 从微信分享的网页中启动APP - mattdong1024的专栏 - CSDN",
            "most_related_para": 1,
            "segmented_title": [
                "android", "从", "微信", "分享", "的", "网页", "中", "启动", "APP", "-", "matt", "dong",
                "1024", "的", "专栏", "-", "CSDN"
            ],
            "segmented_paragraphs": [
                ["版权声明", ":", "本", "文", "为", "博", "主", "原创文章", ",", "未经", "博", "主", "允许", "不得转载", "。"],
                ["项目", "中", "有", "个", "需求", ",", "让", "用户", "可以", "从", "分享", "到", "微信", "的", "网页", "中", "启动",
                 "自己", "的", "APP", ",", "如果", "本", "机", "没有", "安装", "该", "应用程序", "则", "打开", "应用", "商店", "并", "打开",
                 "该", "程序", "在", "商店", "中", "的", "搜索", "结果", "页面", "。", "在这里", "跟", "大家", "分享", "一", "下", ":"],
                ["首先", "需要", "和", "服务端", "协商", "好", "网页", "中", "按钮", "点击", "事件", "的", "字段"],
                ["<", "a", "href", "=", "\"", "myapp", ":", "/", "/", "www", ".", "haodf", ".", "com", "\"", ">",
                 "启动", "应用程序", "<", "/", "a", ">"],
                ["<", "a", "href", "=", "\"", "[", "scheme", "]", ":", "/", "/", "[", "host", "]", "/", "[",
                 "path", "]", "?", "[", "query", "]", "\"", ">", "启动", "应用程序", "<", "/", "a", ">"],
                ["各", "个", "项目", "含义", "如", "下", "所示", ":"], ["scheme", ":", "判别", "启动", "的", "App", "。"],
                ["path", ":", "传值", "时", "必须", "的", "key"], ["query", ":", "获取", "值", "的", "Key", "和", "Value"],
                ["如果", "只是", "启动", "APP", "而", "不需要", "传值", "的", "话", ",", "一", "个", "scheme", "字段", "就", "足够",
                 "了"],
                ["在", "客户端", "(", "android", ")", "需要", "做", "的", "就是", "在", "Android", "Manifest", ".", "xml",
                 "文件", "中", "对", "Main", "Activity", "的", "<", "intent", "-", "filter", ">", "中", "增加", "一", "个",
                 "<", "data", ">", "标签"],
                ["<", "data", "android", ":", "scheme", "=", "\"", "myapp", "\"", "/", ">"],
                ["原来", "很简单", "嘛", ",", "加上", "之后", "运行", "程序", ",", "测试", "一切正常", ",", "退出", "程序", "回到", "桌面",
                 ",", "哎呦", "我", "去", ",", "我", "的", "APP", "跑", "哪", "去", "了", "?", "!", "!", "!"],
                ["原来", ",", "当", "我们", "在", "原来", "的", "<", "intent", "-", "filter", ">", "中", "增加", "<", "data",
                 ">", "标签", "后", ",", "相当于", "入口", "activity", "由", "一", "个", "隐式", "的", "intent", "来", "启动", ",",
                 "应用", "图标", "自然", "就", "不见", "了", ","],
                ["要", "解决", "该", "问题", "也", "比较", "简单", ",", "只", "需要", "在", "该", "activity", "中", "再", "加一", "个",
                 "<", "intent", "-", "filter", ">", "标签", ",", "把", "<", "data", ">", "挪到", "新", "的", "标签", "中",
                 "就", "可以", "了", "。"],
                ["<", "intent", "-", "filter", ">", "<", "action", "android", ":", "name", "=", "\"", "android",
                 ".", "intent", ".", "action", ".", "MAIN", "\"", "/", ">", "<", "action", "android", ":", "name",
                 "=", "\"", ".", "start", ".", "Splash", "Activity", "\"", "/", ">", "<", "category", "android",
                 ":", "name", "=", "\"", "android", ".", "intent", ".", "category", ".", "LAUNCHER", "\"", "/",
                 ">", "<", "/", "intent", "-", "filter", ">", "<", "intent", "-", "filter", ">", "<", "data",
                 "android", ":", "scheme", "=", "\"", "doctor", "app", "scheme", "\"", "/", ">", "<", "category",
                 "android", ":", "name", "=", "\"", "android", ".", "intent", ".", "category", ".", "DEFAULT",
                 "\"", "/", ">", "<", "/", "intent", "-", "filter", ">"],
                ["实践", ":", "从", "微信", "分享", "的", "网页", "中", "启动", "app", ",", "如果", "本", "机", "安装", "了", "该",
                 "应用", "可以", "正常", "启动", ",", "如果没有", "安装", "该", "应用", ",", "会", "跳转", "到", "应用宝", "的", "网页", ",",
                 "提示", "你", "下载", "应用"],
                ["如果", "是", "从", "其他", "浏览器", "启动", "app", "的", "话", ",", "除了", "自带", "浏览器", "和", "谷歌", "浏览器",
                 "外", ",", "其他", "第三方", "浏览器", "可能会", "有", "兼容性", "问题", ",", "也就是说", ",", "有", "可能", "无法", "从",
                 "第三方", "浏览器", "启动", "app", "。"], ["相关文章", "推荐"], ["猜", "你", "在", "找"], ["个人资料"], ["文章", "搜索"],
                ["文章分类"], ["文章", "存档"], ["阅读排行"], ["评论", "排行"], ["推荐", "文章"], ["最新评论"]
            ],
            "paragraphs": [
                "版权声明:本文为博主原创文章,未经博主允许不得转载。",
                "项目中有个需求,让用户可以从分享到微信的网页中启动自己的APP,如果本机没有安装该应用程"
                "序则打开应用商店并打开该程序在商店中的搜索结果页面。在这里跟大家分享一下:",
                "首先需要和服务端协商好网页中按钮点击事件的字段", "<a href=\"myapp://www.haodf.com\">启动应用程序</a>",
                "<a href=\"[scheme]://[host]/[path]?[query]\">启动应用程序</a>", "各个项目含义如下所示:",
                "scheme:判别启动的App。", "path:传值时必须的key", "query:获取值的Key和Value",
                "如果只是启动APP而不需要传值的话,一个scheme字段就足够了",
                "在客户端(android)需要做的就是在AndroidManifest.xml文件中对MainActivity的<intent-filter>中增加一个<data>标签",
                "<data android:scheme=\"myapp\"/>",
                "原来很简单嘛,加上之后运行程序,测试一切正常,退出程序回到桌面,哎呦我去,我的APP跑哪去了?!!!",
                "原来,当我们在原来的<intent-filter>中增加<data>标签后,相当于入口activity由一个隐式的intent来启动,应用图标自然就不见了,",
                "要解决该问题也比较简单,只需要在该activity中再加一个<intent-filter>标签,把<data>挪到新的标签中就可以了。",
                "<intent-filter> <action android:name=\"android.intent.action.MAIN\"/> "
                "<action android:name=\".start.SplashActivity\"/> "
                "<category android:name=\"android.intent.category.LAUNCHER\"/> "
                "</intent-filter> <intent-filter> <data android:scheme=\"doctorappscheme\" /> "
                "<category android:name=\"android.intent.category.DEFAULT\" /> </intent-filter>",
                "实践:从微信分享的网页中启动app,如果本机安装了该应用可以正常启动,如果没有安装该应用,会跳转到应用宝的网页,提示你下载应用",
                "如果是从其他浏览器启动app的话,除了自带浏览器和谷歌浏览器外,其他第三方浏览器可能会有兼容性问题,"
                "也就是说,有可能无法从第三方浏览器启动app。", "相关文章推荐",
                "猜你在找", "个人资料", "文章搜索", "文章分类", "文章存档", "阅读排行", "评论排行", "推荐文章", "最新评论"
            ],
            "bs_rank_pos": 3
        },
        {
            "is_selected": True,
            "title": "微信浏览器中点击链接怎么打开本地app_百度经验",
            "most_related_para": 4,
            "segmented_title": [
                "微信", "浏览器", "中", "点击", "链接", "怎么", "打开", "本地", "app", "_",
                "百度", "经验"
            ],
            "segmented_paragraphs": [
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["微信", "已经成为", "现代人", "生活", "中", "必不可少", "的", "一部分",
                 ",", "下面", "我", "就", "教", "大家", "如何", "在", "微信", "浏览器",
                 "中", "打开", "本地", "APP", "吧", "!"],
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["百度", "经验", ":", "jingyan", ".", "baidu", ".", "com"],
                ["1", "将", "手机", "微信", "打开", "。", "步骤", "阅读", "2", "打开",
                 "微信", "中", "的", "链接", "。", "步骤", "阅读", "3", "如图", "我们",
                 "打开", "百度", "经验", "的", "链接", ",", "用", "微信", "浏览器",
                 "进入", "网页", "以后", ",", "点击", "右", "上方", "如图", "符号",
                 "。", "步骤", "阅读", "4", "进入", "选择", "页面", ",", "点击", "“",
                 "在", "浏览器", "”", "打开", "。", "步骤", "阅读", "5", "如图",
                 "会出现", "手机", "已", "安装", "的", "本地", "APP", "浏览器", ",",
                 "我们", "选择", "一", "个", "自己", "想", "用", "的", "本地", "浏览器",
                 "点击", "下方", "“", "仅", "一次", "”", "或", "“", "总是", "”",
                 "都", "可以", "打开", "打开", "本地", "APP", "浏览器", "。", "步骤",
                 "阅读", "6", "此时", ",", "我们", "就", "已经", "在", "微信",
                 "浏览器", "中将", "本地", "APP", "浏览器", "打开", "了", "步骤", "阅读",
                 "END"],
                ["经验", "内容", "仅供参考", ",", "如果", "您", "需", "解决", "具体",
                 "问题", "(", "尤其", "法律", "、", "医学", "等", "领域", ")", ",",
                 "建议", "您", "详细", "咨询", "相关", "领域", "专业人士", "。"]
            ],
            "paragraphs": [
                "百度经验:jingyan.baidu.com",
                "微信已经成为现代人生活中必不可少的一部分,下面我就教大家如何在微信浏览器中打开本地APP吧!",
                "百度经验:jingyan.baidu.com", "百度经验:jingyan.baidu.com",
                "1 将手机微信打开。 步骤阅读 2 打开微信中的链接。 步骤阅读 3 如图我们打开百度经验的链接,"
                "用微信浏览器进入网页以后,点击右上方如图符号。 步骤阅读 4 进入选择页面,点击“在浏览器”打开。 "
                "步骤阅读 5 如图会出现手机已安装的本地APP浏览器,我们选择一个自己想用的本地浏览器点击下方“仅一次”或“"
                "总是”都可以打开打开本地APP浏览器。 步骤阅读 6 此时,我们就已经在微信浏览器中将本地APP浏览器打开了 步骤阅读 END",
                "经验内容仅供参考,如果您需解决具体问题(尤其法律、医学等领域),建议您详细咨询相关领域专业人士。"
            ],
            "bs_rank_pos": 4
        }
    ],
    "answer_spans": [[0, 110]],
    "fake_answers": [
        "1将手机微信打开。步骤阅读2打开微信中的链接。步骤阅读3如图我们打开百度经验的链接,用微信浏览器进入网页以后,点击右上方如图符号。"
        "步骤阅读4进入选择页面,点击“在浏览器”打开。步骤阅读5如图会出现手机已安装的本地APP浏览器,我们选择一个自己想用的本地浏览器点击下方“"
        "仅一次”或“总是”都可以打开打开本地APP浏览器。步骤阅读6此时,我们就已经在微信浏览器中将本地APP浏览器打开了"
    ],
    "question": "微信分享链接打开app",
    "segmented_answers": [
        [
            "iOS", "里", "，", "把", "一", "个", "页面", "链接", "分享", "给", "微信", "好友", "（", "会话", "）", "，", "好友", "在", "微信",
            "里",
            "打开", "这个", "链接", ",", "也", "就是", "打开", "了", "一", "个", "网页", "，", "点击", "网页", "里", "的", "某", "个", "地方", "后",
            "（", "比如", "网页", "中", "“", "打开", "xx", "应用程序", "”", "的", "按钮", "）", "，", "代码", "里", "怎么", "设置", "可以", "跳",
            "回到", "第三方", "app", "？", "知乎", "的", "ios", "客户端", "就", "有", "这种", "功能", "，", "在", "微信", "里", "分享", "链接",
            "后",
            "，", "点", "开", "链接", "，", "再", "点", "网页", "中", "的", "某处", "，", "就", "可以", "打开", "知乎", "客户端", "。"
        ],
        [
            "1", "、", "首先", "打开", "腾讯", "开放", "平台", "，", "注册", "开放", "平台", "的", "一", "个", "账号", "。", "2", "、", "登录",
            "后",
            "在", "”", "管理", "中心", "“", "中", "创建", "应用", "。", "3", "、", "选择", "创建", "应用", "的", "类型", "如", "下", "图", "所示",
            "，", "然后", "按钮", "提示", "填写", "应用", "的", "相关", "信息", "，", "提交", "进入", "审核", "。", "4", "、", "应用", "审核", "通过",
            "后", "会", "在", "管理", "中心", "中", "显示", "”", "已", "上线", "“", "，", "然后", "点击", "应用", "的", "图标", "。", "5", "、",
            "在", "应用", "详情", "中", "找到", "运营", "服务", "中", "的", "”", "微", "下载", "“", "。", "6", "、", "在", "详情", "页面", "中",
            "就", "可以", "看到", "系统", "生成", "的", "推广", "链接地址", "了", "，", "复制", "此", "地址", "就", "可以", "微信", "中", "转发", "了",
            "。"
        ],
        [
            "1", "将", "手机", "微信", "打开", "。", "2", "打开", "微信", "中", "的", "链接", "。", "3", "我们", "打开", "百度", "经验", "的",
            "链接",
            "，", "用", "微信", "浏览器", "进入", "网页", "以后", "，", "点击", "右", "上方", "如图", "符号", "。", "4", "进入", "选择", "页面", "，",
            "点击", "“", "在", "浏览器", "”", "打开", "。", "5", "出现", "手机", "已", "安装", "的", "本地", "APP", "浏览器", "，", "我们", "选择",
            "一", "个", "自己", "想", "用", "的", "本地", "浏览器", "点击", "下方", "“", "仅", "一次", "”", "或", "“", "总是", "”", "都", "可以",
            "打开", "打开", "本地", "APP", "浏览器", "。", "6", "此时", "，", "我们", "就", "已经", "在", "微信", "浏览器", "中将", "本地", "APP",
            "浏览器", "打开", "了", "。"
        ]
    ],
    "answers": [
        "iOS里，把一个页面链接分享给微信好友（会话），好友在微信里打开这个链接,也就是打开了一个网页，点击网页里的某个地方后"
        "（比如网页中“打开xx应用程序”的按钮），代码里怎么设置可以跳回到第三方app？知乎的ios客户端就有这种功能，"
        "在微信里分享链接后，点开链接，再点网页中的某处，就可以打开知乎客户端 。",
        "1、首先打开腾讯开放平台，注册开放平台的一个账号。2、登录后在”管理中心“中创建应用。"
        "3、选择创建应用的类型如下图所示，然后按钮提示填写应用的相关信息，提交进入审核。"
        "4、应用审核通过后会在管理中心中显示”已上线“，然后点击应用的图标。"
        "5、在应用详情中找到运营服务中的”微下载“。6、在详情页面中就可以看到系统生成的推广链接地址了，复制此地址就可以微信中转发了。",
        "1将手机微信打开。2打开微信中的链接。3我们打开百度经验的链接，用微信浏览器进入网页以后，点击右上方如图符号。"
        "4进入选择页面，点击“在浏览器”打开。5出现手机已安装的本地APP浏览器，"
        "我们选择一个自己想用的本地浏览器点击下方“仅一次”或“总是”都可以打开打开本地APP浏览器。"
        "6此时，我们就已经在微信浏览器中将本地APP浏览器打开了。"
    ],
    "answer_docs": [4],
    "segmented_question": ["微信", "分享", "链接", "打开", "app"],
    "question_type": "DESCRIPTION",
    "question_id": 91159,
    "fact_or_opinion": "FACT",
    "match_scores": [0.8815165876777251]
}
